RouNNdeL/esp8266-leds/src/main.cpp
#include <Arduino.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <WiFiUdp.h>
#include <ESP8266httpUpdate.h>
#include <ArduinoOTA.h>

extern "C" {
#include "user_interface.h"
#include "color_utils.h"
}

#include "config.h"
#include "memory.h"

Adafruit_NeoPixel strip = Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
ESP8266WebServer server(80);

#define FLAG_NEW_FRAME (1 << 0)
#define FLAG_QUICK_TRANSITION (1 << 2)
#define FLAG_HALT (1 << 7)

#define not_halt() !(flags & FLAG_HALT)
#define halt() flags & FLAG_HALT

os_timer_t frameTimer;
volatile uint32_t frame;
volatile uint8_t flags;

led_count_t virtual_devices[DEVICE_COUNT] = VIRTUAL_DEVICES;

global_settings globals;
#define increment_profile() globals.current_profile = (globals.current_profile+1)%globals.profile_count

/* The first 3 bytes are the current color, the last 3 bytes are the old color to transition from */
uint8_t color_converted[6 * DEVICE_COUNT] = {};
volatile transition_t transition_frame[DEVICE_COUNT] = {0};
transition_t transition_frames[DEVICE_COUNT];
String requestId = "";

device_profile current_profile[DEVICE_COUNT];
uint16_t frames[DEVICE_COUNT][TIME_COUNT];
uint32_t auto_increment;

#define ALL 0
#define ANY 1
#define SET 1
#define NOT_SET 0

#define all_enabled() all_any_flag_set(GLOBALS_FLAG_ENABLED, ALL, SET)
#define any_enabled() all_any_flag_set(GLOBALS_FLAG_ENABLED, ANY, SET)
#define all_disabled() all_any_flag_set(GLOBALS_FLAG_ENABLED, ALL, NOT_SET)
#define any_disabled() all_any_flag_set(GLOBALS_FLAG_ENABLED, ANY, NOT_SET)

uint8_t all_any_flag_set(uint8_t flag, uint8_t any, uint8_t set)
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        if(globals.flags[i] & flag ^ set ^ any)
            return any;
    }
    return !any;
}

uint16_t time_to_frames(uint8_t time)
{
    if(time <= 80)
    {
        return time * FPS / 16;
    }
    if(time <= 120)
    {
        return time * FPS / 8 - 5 * FPS;
    }
    if(time <= 160)
    {
        return time * FPS / 2 - 50 * FPS;
    }
    if(time <= 190)
    {
        return (time - 130) * FPS;
    }
    if(time <= 235)
    {
        return (2 * time - 320) * FPS;
    }
    if(time <= 245)
    {
        return (15 * time - 3375) * FPS;
    }
    return (60 * time - 14400) * FPS;
}

void convert_to_frames(uint16_t *frames, uint8_t *times)
{
    for(uint8_t i = 0; i < TIME_COUNT; ++i)
    {
        frames[i] = time_to_frames(times[i]);
    }
}

void convert_all_frames()
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        convert_to_frames(frames[i], current_profile[i].timing);
    }
}

uint32_t autoincrement_to_frames(uint8_t time)
{
    if(time <= 60)
    {
        return time * FPS / 2;
    }
    if(time <= 90)
    {
        return (time - 30) * FPS;
    }
    if(time <= 126)
    {
        return (5 * time / 2 - 165) * FPS;
    }
    if(time <= 156)
    {
        return (5 * time - 480) * FPS;
    }
    if(time <= 196)
    {
        return (15 * time - 2040) * FPS;
    }
    if(time <= 211)
    {
        return (60 * time - 10860) * FPS;
    }
    if(time <= 253)
    {
        return (300 * time - 61500) * FPS;
    }
    if(time == 254) return 18000 * FPS;
    return 21600 * FPS;
}

void convert_color()
{
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
    {
        uint8_t index = d * 6;

        /* Copy the now old color to its place (3 bytes after the new) */
        memcpy(color_converted + index + 3, color_converted + index, 3);

        uint8_t brightness = (globals.flags[d] & GLOBALS_FLAG_ENABLED) ? globals.brightness[d] : 0;
        set_color_manual(color_converted + index, color_brightness(brightness, color_from_buf(globals.color + d * 3)));
        color_brightness(brightness, color_from_buf(globals.color + d * 3));

        if(globals.flags[d] & FLAG_QUICK_TRANSITION)
            transition_frames[d] = TRANSITION_QUICK_FRAMES;
        else
            transition_frames[d] = TRANSITION_FRAMES;
        globals.flags[d] |= GLOBALS_FLAG_TRANSITION;
    }

}

void refresh_devices()
{
    for(uint8_t d = 0; d < DEVICE_COUNT; d++)
    {
        load_device(&current_profile[d], d, globals.current_device_profile[d]);
    }
}

void load_profile(uint8_t n)
{
    for(uint8_t d = 0; d < DEVICE_COUNT; d++)
    {
        if(globals.profiles[n][d] > -1)
        {
            load_device(&current_profile[d], d, globals.profiles[n][d]);
            globals.current_device_profile[d] = globals.profiles[n][d];
        }
    }
    globals.profile_flags[globals.current_profile] = globals.profile_flags[n];
    save_globals(&globals);
}

void refresh_profile()
{
    load_profile(globals.current_profile);
    convert_all_frames();
}

void timerCallback(void *pArg)
{
    flags |= FLAG_NEW_FRAME;
    frame++;
    for(int d = 0; d < DEVICE_COUNT; ++d)
    {
        if(globals.flags[d] & GLOBALS_FLAG_TRANSITION)
        {
            transition_frame[d]++;
        }
    }
}

void user_init()
{
    os_timer_setfn(&frameTimer, timerCallback, NULL);
    os_timer_arm(&frameTimer, 10, true);
}

void eeprom_init()
{
    load_globals(&globals);
    auto_increment = autoincrement_to_frames(globals.auto_increment);
    refresh_profile();
    convert_color();
}

uint8_t char2int(char input)
{
    if(input >= '0' && input <= '9')
        return input - '0';
    if(input >= 'A' && input <= 'F')
        return input + 10 - 'A';
    if(input >= 'a' && input <= 'f')
        return input + 10 - 'a';
    return 0;
}

void setStripStatus(uint8_t r, uint8_t g, uint8_t b)
{
    led_count_t virtual_led_offset = 0;
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
    {
        uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
        if(!(globals.flags[d] & GLOBALS_FLAG_STATUSES))
            return;
        strip.setBrightness(UINT8_MAX);
        for(led_count_t j = 0; j < virtual_devices[d]; ++j)
        {
            if(j % 4)
            {
                set_color_manual(p, grb(color_brightness(12, r, g, b)));
            }
            else
            {
                set_color_manual(p, grb(r, g, b));
            }
        }
        strip.show();
        virtual_led_offset += virtual_devices[d];
    }
}

int32_t checkUpdate()
{
    int32_t code;
    uint8_t tries = 0;
    do
    {
        tries++;
        HTTPClient http;

#if HTTP_UPDATE_HTTPS
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTPS, String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                   HTTP_SERVER_HTTPS_FINGERPRINT);
#else
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTP, String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID);
#endif /* HTTP_UPDATE_HTTPS */
        http.useHTTP10(true);
        http.setTimeout(2500);
        http.setUserAgent(F("ESP8266-http-Update"));
        http.addHeader(F("x-Request-Attempts"), String(tries));
        http.addHeader(F("x-ESP8266-STA-MAC"), WiFi.macAddress());
        http.addHeader(F("x-ESP8266-AP-MAC"), WiFi.softAPmacAddress());
        http.addHeader(F("x-ESP8266-free-space"), String(ESP.getFreeSketchSpace()));
        http.addHeader(F("x-ESP8266-sketch-size"), String(ESP.getSketchSize()));
        http.addHeader(F("x-ESP8266-sketch-md5"), String(ESP.getSketchMD5()));
        http.addHeader(F("x-ESP8266-chip-size"), String(ESP.getFlashChipRealSize()));
        http.addHeader(F("x-ESP8266-sdk-version"), ESP.getSdkVersion());
        http.addHeader(F("x-ESP8266-mode"), F("check"));
        http.addHeader(F("x-ESP8266-version"), String(VERSION_CODE));

        code = http.GET();
        http.end();
    }
    while((code == -1 || code == -11) && tries < REQUEST_RETIRES);
    return code;
}

