RouNNdeL/esp8266-leds/src/main.cpp
#endif /* PAGE_DEBUG */

void ICACHE_FLASH_ATTR receive_globals()
{
    if(server.hasArg("plain") &&
       server.method() == HTTP_PUT &&
       (server.arg("plain").length() == GLOBALS_SIZE * 2 ||
        (server.arg("plain").length() < GLOBALS_SIZE * 2 && server.arg("plain").end()[-1] == '*') ||
        (server.arg("plain").length() <= GLOBALS_SIZE * 2 + 1 && server.arg("plain")[0] == 'q')))
    {
        uint8_t bytes[GLOBALS_SIZE];
        uint8_t quick = server.arg("plain")[0] == 'q' ? 1 : 0;
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < GLOBALS_SIZE; ++i)
        {
            uint8_t j = i * 2 + quick;
            if(c[j] == '*' || c[j + 1] == '*')
            {
                memcpy(bytes + i, ((uint8_t *) &globals) + i, GLOBALS_SIZE - i);
                break;
            }
            if(c[j] == '?' && c[j + 1] == '?')
            {
                bytes[i] = ((uint8_t *) &globals)[i];
            }
            else
            {
                bytes[i] = char2int(c[j]) * 16 + char2int(c[j + 1]);
            }
        }

        uint8_t last_profile = globals.current_profile;
        uint8_t previous_auto_increment = globals.auto_increment;
        memcpy(&globals, bytes, GLOBALS_SIZE);
        if(last_profile != globals.current_profile)
        {
            frame = 0;
            refresh_profile();
        }
        else
        {
            refresh_devices();
        }
        if(previous_auto_increment != globals.auto_increment)
        {
            auto_increment = autoincrement_to_frames(globals.auto_increment);
        }
        save_globals(&globals);

        server.send(204);
        requestId = server.header("x-Request-Id");
        quick ? (flags |= FLAG_QUICK_TRANSITION) : (flags &= ~FLAG_QUICK_TRANSITION);
        convert_color();
    }
    else
    {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR redirect_to_config()
{
    server.sendHeader("Location", CONFIG_PAGE);
    server.send(301);
}

void ICACHE_FLASH_ATTR receive_profile()
{
    if(server.hasArg("plain") && server.arg("plain").length() == (DEVICE_SIZE + 2) * 2 && server.method() == HTTP_PUT)
    {
        uint8_t bytes[DEVICE_SIZE + 2];
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < sizeof(bytes); ++i)
        {
            bytes[i] = char2int(c[i * 2]) * 16 + char2int(c[i * 2 + 1]);
        }

        if(globals.current_device_profile[bytes[1]] == bytes[0])
        {
            memcpy(&current_profile[bytes[1]], bytes + 2, DEVICE_SIZE);
            convert_all_frames();
            globals.flags[bytes[1]] |= GLOBALS_FLAG_PROFILE_UPDATED;
        }
        else
        {
            device_profile tmp;
            memcpy(&tmp, bytes + 1, DEVICE_SIZE);
            save_profile(&tmp, bytes[1], bytes[0]);
        }
        server.send(204);
    }
    else
    {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR explicit_save()
{
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
    {
        if(globals.flags[d] & GLOBALS_FLAG_PROFILE_UPDATED)
        {
            save_profile(&current_profile[d], d, globals.current_device_profile[d]);
            globals.flags[d] &= ~GLOBALS_FLAG_PROFILE_UPDATED;
        }
    }
    server.send(200);
}

void ICACHE_FLASH_ATTR handle_halt()
{
    server.send(200, "text/plain", "Device has been halted to allow for manual recovery via ArduinoOTA");
}

void ICACHE_FLASH_ATTR handle_root()
{
    // TODO: Add separate pages for each virtual device
    String r = String(globals.color[0], 16);
    String g = String(globals.color[1], 16);
    String b = String(globals.color[2], 16);
    r = r.length() == 1 ? "0" + r : r;
    g = g.length() == 1 ? "0" + g : g;
    b = b.length() == 1 ? "0" + b : b;
    String content =
            R"(<!DOCTYPE html><html lang="en"><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width, initial-scale=1.0"><title>)" +
            String(AP_NAME) + "</title></head><body><h2>" + AP_NAME +
            R"(</h2><p>You can change profiles and set a static color for your LEDs, for more advanced configuration click <a href="/config">here</a></p> <input id="a" type="color" value="#)" +
            r + g + b + R"(">)";
    content +=
            R"(<p><a href="/restart">Restart device</a></p><p><a href="/update">Check for updates</a></p> <script>document.getElementById("a").addEventListener("change",function(e){var t=new XMLHttpRequest;t.open("PUT","/globals",!0),t.send("????".repeat()" +
            String(DEVICE_COUNT) + R"()+e.target.value.substring(1).repeat()" + String(DEVICE_COUNT) +
            R"()+"*")});</script> </body></html>)";
    server.send(200, "text/html", content);
}

void ICACHE_FLASH_ATTR restart()
{
    server.send(200, "text/html",
                F("<p>Your device is restarting...</p><p id=\"a\">It should come online in 15s</p><script>var a=15;setInterval(function(){a--; if(!a)window.location=\"/\";document.getElementById(\"a\").innerHTML=\"It should come online in \"+a+\"s\";},1000)</script>"));
    delay(500);
    ESP.restart();
}

void ICACHE_FLASH_ATTR send_json()
{
    server.send(200, "application/json", getDeviceJson());
}

void ICACHE_FLASH_ATTR manual_update_check()
{
    auto code = checkUpdate();
    String statusString;
    switch(code)
    {
        case HTTP_CODE_NO_CONTENT:
            statusString = "Update found, click <a href=\"/apply_update\">here</a> to download and apply the update";
            break;
        case HTTP_CODE_NOT_MODIFIED:
            statusString = "No updates found, <a href=\"/\">return to the main page<a/>";
            break;
        default:
            statusString = "Update check failed: HTTP " + code;
            break;
    }
    server.send(200, "text/html", statusString);
}

void ICACHE_FLASH_ATTR apply_update()
{
    server.send(200, "text/html",
                "<p>The device will now download the update and restart to apply the changes</p><p><a href=\"/\">Main page</a></p>");
    delay(500);
    update(1);
}

void on_disconnected(const WiFiEventStationModeDisconnected &event)
{
    ESP.restart();
}

void configModeCallback(WiFiManager *myWiFiManager)
{
    setStripStatus(COLOR_CYAN);
}

void recover()
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        globals.brightness[i] = 0xff;
        globals.flags[i] = GLOBALS_FLAG_ENABLED | GLOBALS_FLAG_STATUSES;
        globals.profiles[0][i] = 0;
        globals.current_device_profile[i] = 0;

        current_profile[i].effect = BREATHE;
        current_profile[i].color_count = 3;
        current_profile[i].timing[TIME_OFF] = 0;
        current_profile[i].timing[TIME_FADEIN] = 10;
        current_profile[i].timing[TIME_ON] = 0;
        current_profile[i].timing[TIME_FADEOUT] = 10;
        current_profile[i].timing[TIME_ROTATION] = 0;
        current_profile[i].timing[TIME_DELAY] = 0;
        current_profile[i].args[ARG_BREATHE_START] = 0;
        current_profile[i].args[ARG_BREATHE_END] = 255;
        current_profile[i].args[ARG_COLOR_CYCLES] = 1;
        set_color_manual(current_profile[i].colors, grb(COLOR_RED));
        set_color_manual(current_profile[i].colors + 3, grb(COLOR_BLUE));
        set_color_manual(current_profile[i].colors + 6, grb(COLOR_GREEN));

        save_profile(&current_profile[i], i, 0);
    }

    globals.auto_increment = 0;
    globals.profile_count = 1;
    globals.current_profile = 0;

