RouNNdeL/esp8266-leds/src/main.cpp
    convert_all_frames();

    save_globals(&globals);
    convert_color();
}

void ICACHE_FLASH_ATTR handle_recover()
{
    recover();
    server.send(204);
}

void setup()
{
#if SERIAL_DEBUG
    Serial.begin(115200);

    Serial.println("");
    Serial.println("|---------------------------|");
    Serial.println("|------ Begin Startup ------|");
    Serial.println("| LED Controller by RouNdeL |");
    Serial.println("|---------------------------|");

    Serial.println("Version Name: " + String(VERSION_NAME));
    Serial.println("Version Code: " + String(VERSION_CODE));
    Serial.println("Build Date: " + BUILD_DATE);
    Serial.println("Device Id: " + String(DEVICE_ID));
#endif /* SERIAL_DEBUG */

    EEPROM.begin(SPI_FLASH_SEC_SIZE);
    if(ESP.getResetInfoPtr()->reason == REASON_EXCEPTION_RST)
    {
#if SERIAL_DEBUG
        Serial.println("Exception detected: "+String(get_reset_count()+1));
#endif /* SERIAL_DEBUG */
        if(get_reset_count() > RECOVERY_ATTEMPTS)
        {
            flags |= FLAG_HALT;
#if SERIAL_DEBUG
            Serial.println("HALT");
#endif /* SERIAL_DEBUG */
        }
        else if(get_reset_count() > RESTART_ATTEMPTS)
        {
            recover();
#if SERIAL_DEBUG
            Serial.println("Attempting to recover");
#endif /* SERIAL_DEBUG */
        }
        increase_reset_count();
    }
    else
    {
        set_reset_count(0);
    }

    if(not_halt())
    {
        eeprom_init();
        strip.begin();
        setStripStatus(COLOR_RED);
    }

    WiFiManager manager;
#if !SERIAL_DEBUG
    manager.setDebugOutput(0);
#endif /* SERIAL_DEBUG */
    manager.setAPCallback(configModeCallback);
    manager.setAPStaticIPConfig(IPAddress(192, 168, 1, 1), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0));
    manager.setConfigPortalTimeout(300);
    manager.autoConnect(AP_NAME);

    if(not_halt() && checkUpdate() == HTTP_CODE_OK) update(1);

#if SERIAL_DEBUG
    Serial.println("|---------------------------|");
    Serial.println("|------- Start LEDs --------|");
    Serial.println("|---------------------------|");
#endif /* SERIAL_DEBUG */

    WiFi.onStationModeDisconnected(on_disconnected);

    if(not_halt())
    {
#if PAGE_DEBUG
        server.on("/debug", debug_info);
#endif /* PAGE_DEBUG */
        server.on("/", handle_root);
        server.on("/recover", handle_recover);
        server.on("/config", redirect_to_config);
        server.on("/globals", receive_globals);
        server.on("/profile", receive_profile);
        server.on("/api", send_json);
        server.on("/update", manual_update_check);
        server.on("/save", explicit_save);
        server.on("/apply_update", apply_update);

        const char *headers[] = {"x-Request-Id"};
        size_t headers_size = sizeof(headers) / sizeof(char *);
        server.collectHeaders(headers, headers_size);

        server.begin();
        user_init();
    }
    else
    {
        sendDeviceHalted();
        server.on("/", handle_halt);
        server.begin();
    }

    server.on("/restart", restart);

    ArduinoOTA.begin();
}

void loop()
{
    ArduinoOTA.handle();

    /* We do not want the transition to lag, so we don't handle the client */
    if(halt() || all_any_flag_set(GLOBALS_FLAG_TRANSITION, ALL, NOT_SET) || flags & FLAG_QUICK_TRANSITION)
    {
        server.handleClient();
    }

    if(halt())
        return;

    if(flags & FLAG_NEW_FRAME)
    {
        flags &= ~FLAG_NEW_FRAME;

        led_count_t virtual_led_offset = 0;
        for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
        {
            uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
            if((globals.flags[d] & GLOBALS_FLAG_ENABLED || globals.flags[d] & GLOBALS_FLAG_TRANSITION) &&
               globals.flags[d] & GLOBALS_FLAG_EFFECTS)
            {

                device_profile &device = current_profile[d];
                digital_effect((effect) device.effect, p, virtual_devices[d], 0, frame + frames[d][TIME_DELAY],
                               frames[d], device.args, device.colors, device.color_count);

                uint8_t brightness = globals.brightness[d];
                /*if(globals.flags[d] & GLOBALS_FLAG_TRANSITION)
                    brightness = transition_frame[d] * brightness / transition_frames[d];*/

                for(uint8_t i = 0; i < virtual_devices[d]; ++i)
                {
                    uint8_t index = i * 3;

                    set_color_manual(p + index, color_brightness(brightness, color_from_buf(p + index)));
                    p[index] = actual_brightness(p[index]);
                    p[index + 1] = actual_brightness(p[index + 1]);
                    p[index + 2] = actual_brightness(p[index + 2]);
                }

                strip.show();
            }
            else if(globals.flags[d] & GLOBALS_FLAG_ENABLED || globals.flags[d] & GLOBALS_FLAG_TRANSITION)
            {
                uint8_t index = d * 6;
                uint8_t color[3];
                cross_fade(color, color_converted + index, 3, 0,
                           transition_frame[d] * UINT8_MAX / transition_frames[d]);
                color[index] = actual_brightness(color[index]);
                color[index + 1] = actual_brightness(color[index + 1]);
                color[index + 2] = actual_brightness(color[index + 2]);
                for(led_count_t i = 0; i < virtual_devices[d]; ++i)
                {
                    set_color_manual(p + i * 3, grb(color_from_buf(color)));
                }
                strip.show();
            }
            else
            {
                for(led_count_t i = 0; i < LED_COUNT; ++i)
                {
                    set_color_manual(p + i * 3, grb(COLOR_BLACK));
                }
                strip.show();
            }

            if(transition_frame[d] >= transition_frames[d] && globals.flags[d] & GLOBALS_FLAG_TRANSITION)
            {
                memcpy(color_converted + d * 6 + 3, color_converted + d * 6, 3);
                globals.flags[d] &= ~GLOBALS_FLAG_TRANSITION;
                transition_frame[d] = 0;
            }

            virtual_led_offset += virtual_devices[d];
        }

        if(auto_increment && frame && frame % auto_increment == 0 && any_enabled() && globals.profile_count > 1)
        {
            for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
            {
                if(globals.flags[d] & GLOBALS_FLAG_PROFILE_UPDATED)
                {
                    save_profile(&current_profile[d], d, globals.current_device_profile[d]);
                    globals.flags[d] &= ~GLOBALS_FLAG_PROFILE_UPDATED;
                }
            }
            increment_profile();
            refresh_profile();
            frame = 0;
        }
    }
}
